;Place localized text in this file


[PR_CombatMedic X2SoldierClassTemplate]
DisplayName="Combat"
ClassSummary="The Combat class claims to be a medic to keep their teammates alive by healing them or saving them from terrible positoning, but in reality they use their shotgun and ripjack to kill everything instead of actually taking any healing abilities."

[DefaultTroopManeuvers_LW X2MissionNarrativeTemplate]

ObjectiveTextPools[4]="Hey, you. You're finally awake."
ObjectiveTextPools[5]="You were trying to cross the border, right? Walked right into that Imperial ambush, same as us, and that thief over there. Damn you Stormcloaks. Skyrim was fine until you came along. Empire was nice and lazy. If they hadn't been looking for you, I could've stolen that horse and be halfway to Hammerfell. You there. You and me - we shouldn't be here. It's these Stormcloaks the Empire wants. We're all brothers and sisters in binds now, thief. Shut up back there! And what's wrong with him, huh? Watch your tongue. You're speaking to Ulfric Stormcloak, the true High King. Ulfric? The Jarl of Windhelm? You're the leader of the rebellion. But if they've captured you... Oh gods, where are they taking us? I don't know where we're going, but Sovngarde awaits. No, this can't be happening. This isn't happening. Hey, what village are you from, horse thief? Why do you care? A Nord's last thoughts should be of home. Rorikstead. I'm... I'm from Rorikstead. looks like the Thalmor are with him. General Tullius, sir. The headsman is waiting. Good. Let's get this over with! Shor, Mara, Dibella, Kynareth, Akatosh. Divines, please help me. Look at him. General Tullius the Military Governor. And it looks like the Thalmor are with him. Damn elves. I bet they had something to do with this. Why are we stopping? Why do you think? End of the line. Let's go. Shouldn't keep the gods waiting for us."

[GrubRegeneration X2AbilityTemplate]
LocFriendlyName="Grub Regeneration"
LocLongDescription="Restores 2 HP per turn"
LocHelpText="Restores 2 HP Per turn"
LocFlyoverText="Regeneration"
LocPromotionPopupText="Restores 2 HP per turn"